Revit 2027 API
PartMakerMethodToDivideVolumes.SetOffsetForIntersectingReference Method
 Sets offset for the intersecting reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetOffsetForIntersectingReference(
	ElementId intersectingReference,
	double offset
)
Public Sub SetOffsetForIntersectingReference (
	intersectingReference As ElementId,
	offset As Double
)
public:
void SetOffsetForIntersectingReference(
	ElementId^ intersectingReference,
	double offset
)
member SetOffsetForIntersectingReference :
        intersectingReference : ElementId *
        offset : float -> unit
Parameters
intersectingReference ElementId
 The intersecting reference that will be offset.
offset Double
 The new offset.
Exceptions
Exception | Condition
ArgumentException |  PartMaker does not use the specified intersecting reference.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace